using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace MindBoxConsolTest
{
    internal class Program
    {
        /* Выполните практическое задание ниже.
         * Отклики без выполненного задания не будут рассмотрены.
         * Пожалуйста, не пишите код внутри форм ответов, разместите его на Github и приложите ссылку.
         * Если в задании что-то непонятно, опишите возникшие вопросы и сделанные предположения. Например, в комментариях в коде.
         * Задание:
         * Напишите на C# библиотеку для поставки внешним клиентам, которая умеет вычислять площадь круга по радиусу и треугольника по трем сторонам.
         * Дополнительно к работоспособности оценим:
         * Юнит-тесты
         * Легкость добавления других фигур
         * Вычисление площади фигуры без знания типа фигуры в compile-time
         * Проверку на то, является ли треугольник прямоугольным
         */

        static void Main(string[] args)
        {
        }
    }
}
